<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Getting Started with iBeacon | 子木的小世界</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x4E3A;&amp;#x7FFB;&amp;#x8BD1;Apple Developer&amp;#x5F00;&amp;#x53D1;&amp;#x6587;&amp;#x6863;Getting Started with iBeacon&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x672C;&amp;#x4EBA;&amp;#x6C34;&amp;#x5E73;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x8">
<meta property="og:type" content="article">
<meta property="og:title" content="Getting Started with iBeacon">
<meta property="og:url" content="http://yoursite.com/2016/04/01/iBeacon/index.html">
<meta property="og:site_name" content="子木的小世界">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x4E3A;&amp;#x7FFB;&amp;#x8BD1;Apple Developer&amp;#x5F00;&amp;#x53D1;&amp;#x6587;&amp;#x6863;Getting Started with iBeacon&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x672C;&amp;#x4EBA;&amp;#x6C34;&amp;#x5E73;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x8">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon字段.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon例子.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon允许.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon信号.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon衰减.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon测距.png">
<meta property="og:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon校准.png">
<meta property="og:updated_time" content="2016-04-01T08:51:06.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Getting Started with iBeacon">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x4E3A;&amp;#x7FFB;&amp;#x8BD1;Apple Developer&amp;#x5F00;&amp;#x53D1;&amp;#x6587;&amp;#x6863;Getting Started with iBeacon&amp;#xFF0C;&amp;#x7531;&amp;#x4E8E;&amp;#x672C;&amp;#x4EBA;&amp;#x6C34;&amp;#x5E73;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x8">
<meta name="twitter:image" content="http://yoursite.com/2016/04/01/iBeacon/iBeacon字段.png">
  
    <link rel="alternate" href="/atom.xml" title="子木的小世界" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">子木的小世界</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-iBeacon" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/04/01/iBeacon/" class="article-date">
  <time datetime="2016-04-01T08:18:02.000Z" itemprop="datePublished">2016-04-01</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Getting Started with iBeacon
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<p>&#x672C;&#x6587;&#x4E3A;&#x7FFB;&#x8BD1;Apple Developer&#x5F00;&#x53D1;&#x6587;&#x6863;<a href="https://developer.apple.com/ibeacon/" target="_blank" rel="external">Getting Started with iBeacon</a>&#xFF0C;&#x7531;&#x4E8E;&#x672C;&#x4EBA;&#x6C34;&#x5E73;&#x95EE;&#x9898;&#xFF0C;&#x80AF;&#x5B9A;&#x5B58;&#x5728;&#x8BF8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x89C1;&#x8C05;&#xFF01;</p>
</blockquote>
<h2 id="&#x6982;&#x51B5;"><a href="#&#x6982;&#x51B5;" class="headerlink" title="&#x6982;&#x51B5;"></a>&#x6982;&#x51B5;</h2><p>iBeacon&#x662F;&#x5728;iOS7&#x65B0;&#x63A8;&#x51FA;&#x7684;&#x611F;&#x77E5;&#x4F4D;&#x7F6E;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5229;&#x7528;&#x4F4E;&#x529F;&#x8017;&#x84DD;&#x7259;&#xFF08;BLE&#xFF09;&#xFF0C;&#x643A;&#x5E26;iBeancon&#x6280;&#x672F;&#x7684;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x56F4;&#x7ED5;&#x67D0;&#x4E00;&#x5BF9;&#x8C61;&#x5EFA;&#x7ACB;&#x76D1;&#x6D4B;&#x533A;&#x57DF;&#x3002;&#x4F9D;&#x636E;iOS&#x8BBE;&#x5907;&#x4E0E;&#x4FE1;&#x53F7;&#x6E90;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x80FD;&#x591F;&#x5224;&#x65AD;&#x8BBE;&#x5907;&#x4F55;&#x65F6;&#x8FDB;&#x5165;&#x6216;&#x8005;&#x79BB;&#x5F00;&#x8BE5;&#x533A;&#x57DF;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4F7F;&#x7528;iBeacon&#x6280;&#x672F;&#x65F6;&#x9700;&#x8981;&#x6709;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x672C;&#x6587;&#x6863;&#x5BF9;&#x4E24;&#x65B9;&#x9762;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x4ECB;&#x7ECD;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x5EFA;&#x8BAE;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x786E;&#x4FDD;&#x6709;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x90E8;&#x7F72;&#xFF0C;&#x4F7F;&#x5F97;&#x6709;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<p>iBeacon&#x6709;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x6839;&#x636E;&#x4F60;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F60;&#x6709;&#x53EF;&#x80FD;&#x626E;&#x6F14;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x4E24;&#x4E2A;&#x751A;&#x81F3;&#x4E09;&#x4E2A;&#xFF1A;</p>
<pre><code>1.    APP &#x5F00;&#x53D1;&#x8005;
    &#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x6DFB;&#x52A0;iBeacon&#x5230;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x5185;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;Core Location APIs ,&#x5F53;iOS&#x8BBE;&#x5907;&#x8FDB;&#x5165;&#x6216;&#x8005;&#x79BB;&#x5F00;&#x68C0;&#x6D4B;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x6536;&#x5230;iOS&#x7684;&#x901A;&#x77E5;&#x3002;&#x4F60;&#x540C;&#x6837;&#x4E5F;&#x80FD;&#x591F;&#x5C06;&#x8BBE;&#x5907;&#x53D1;&#x9001;iBeacon&#x5E7F;&#x544A;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x4F60;&#x53EA;&#x9700;&#x5728;&#x7A0B;&#x5E8F;&#x5185;&#x5305;&#x542B;iOS SDK&#x5373;&#x53EF;&#xFF0C;&#x65E0;&#x9700;license&#x3002;

2.    &#x90E8;&#x7F72;iBeacon&#x8BBE;&#x5907;
    &#x65E0;&#x8BBA;&#x4F60;&#x7BA1;&#x7406;&#x4E00;&#x4E2A;&#x4F53;&#x80B2;&#x7ADE;&#x6280;&#x573A;&#xFF0C;&#x535A;&#x7269;&#x9986;&#xFF0C;&#x96F6;&#x552E;&#x5546;&#x5E97;&#xFF0C;&#x6216;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x6765;&#x4F7F;&#x7528;beacons&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5468;&#x56F4;&#x7684;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x548C;&#x6750;&#x6599;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x6821;&#x51C6;&#x548C;&#x6D4B;&#x8BD5;&#x90E8;&#x7F72;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4F7F;&#x7528;iBeacon Logo&#x5728;&#x4F1A;&#x573A;&#x5185;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;iBeacon&#x6280;&#x672F;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x7533;&#x8BF7;iBeacon Logo &#x7684;licese&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;
    https:// developer.apple.com/ibeacon/ 
    &#x7533;&#x8BF7;&#x3002;

3.    &#x4F7F;&#x7528;iBeacon&#x6280;&#x672F;&#x5236;&#x9020;&#x8BBE;&#x5907;
    &#x5982;&#x679C;&#x4F60;&#x6709;&#x5174;&#x8DA3;&#x5236;&#x9020;iBeacon&#x6280;&#x672F;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x5236;&#x9020;&#x4E4B;&#x524D;&#x7533;&#x8BF7;license&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;https://developer.apple.com/ibeacon/ 
    &#x7533;&#x8BF7;iBeacon license&#x3002; &#x88AB;&#x8BB8;&#x53EF;&#x65B9;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x76F8;&#x5173;&#x6280;&#x672F;&#x89C4;&#x8303;&#xFF0C;&#x4F7F;&#x7528;iBeacon logo&#x4EE5;&#x53CA;iBeacon&#x7684;&#x8BC6;&#x522B;&#x6307;&#x5357;&#x3002;
</code></pre><h2 id="iBeacon&#x6280;&#x672F;&#x8BBE;&#x5907;"><a href="#iBeacon&#x6280;&#x672F;&#x8BBE;&#x5907;" class="headerlink" title="iBeacon&#x6280;&#x672F;&#x8BBE;&#x5907;"></a>iBeacon&#x6280;&#x672F;&#x8BBE;&#x5907;</h2><p>iBeacon&#x6280;&#x672F;&#x7684;&#x8BBE;&#x5907;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EBD;&#x6263;&#x7535;&#x6C60;&#x4F9B;&#x7535;&#x4E00;&#x4E2A;&#x6708;&#x4EE5;&#x4E0A;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x7535;&#x6C60;&#x63D0;&#x4F9B;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x7535;&#x6E90;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#x5DE5;&#x4F5C;&#x3002;iOS&#x8BBE;&#x5907;&#x7EDF;&#x4E00;&#x80FD;&#x591F;&#x914D;&#x7F6E;&#x751F;&#x6210;iBeacon&#x5E7F;&#x544A;&#xFF0C;&#x4F46;&#x662F;&#x529F;&#x80FD;&#x8303;&#x56F4;&#x4E0A;&#x53D7;&#x9650;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x9500;&#x552E;&#x70B9;&#x6216;&#x8005;&#x552E;&#x8D27;&#x4EAD;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x77ED;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x5185;&#x4F7F;&#x7528;iBeacon&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>iBeacon&#x5E7F;&#x544A;&#x901A;&#x8FC7;BLE&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x5B57;&#x6BB5;.png" alt=""></p>
<p>UUID&#xFF0C;Major&#x548C;Minor&#x4E09;&#x4E2A;&#x503C;&#x63D0;&#x4F9B;&#x4E86;iBeacon&#x7684;&#x6807;&#x8BC6;&#x4FE1;&#x606F;&#x3002;<br>&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#x8BE5;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x5BF9;UUID&#x6807;&#x8BC6;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x518D;&#x901A;&#x8FC7;Major&#x548C;Minor&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x7EC6;&#x5206;&#x786E;&#x5B9A;&#x8EAB;&#x4EFD;&#x6027;&#x8D28;&#x3002; UUIDs &#x53EF;&#x4EE5;&#x901A;&#x8FC7;uuidgen&#x547D;&#x4EE4;&#x751F;&#x6210;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;NSUUID&#x57FA;&#x7840;&#x7C7B;&#x751F;&#x6210;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x8868;&#x683C;&#x662F;&#x4E2A;&#x5168;&#x56FD;&#x8FDE;&#x9501;&#x5E97;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E09;&#x4E2A;&#x503C;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;UUID&#x5728;&#x6240;&#x6709;&#x5730;&#x533A;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;iOS&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x8BC6;&#x522B;&#x51FA;&#x4EFB;&#x4F55;&#x5B58;&#x50A8;&#x7684;&#x5355;&#x4E2A;&#x68C0;&#x6D4B;&#x533A;&#x57DF;&#x3002;&#x6BCF;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5546;&#x5E97;&#xFF0C;&#x65E7;&#x91D1;&#x5C71;&#xFF0C;&#x5DF4;&#x9ECE;&#x548C;&#x4F26;&#x6566;&#xFF0C;&#x90FD;&#x80FD;&#x88AB;&#x5206;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;Major&#x503C;&#xFF0C;&#x4F7F;&#x5F97;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x51FA;&#x8BE5;&#x5546;&#x5E97;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x5546;&#x5E97;&#xFF0C;&#x4E0D;&#x540C;&#x90E8;&#x95E8;&#x5206;&#x914D;&#x4E0D;&#x540C;&#x7684;Minor&#x7684;&#x503C;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x4E0D;&#x540C;&#x5E97;&#x91CC;&#x503C;&#x4F1A;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x591F;&#x4F7F;App&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x8BC6;&#x522B;&#x51FA;&#x8BE5;&#x90E8;&#x95E8;&#x3002;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x4F8B;&#x5B50;.png" alt=""></p>
<p>&#x4F7F;&#x7528;&#x4EE5;&#x4E0A;&#x4FE1;&#x606F;&#xFF0C;iOS&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x51FA;&#x5B83;&#x8FDB;&#x5165;&#x6216;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FDB;&#x5165;&#x7684;&#x5546;&#x5E97;&#x548C;&#x7ECF;&#x8FC7;&#x7684;&#x90E8;&#x95E8;&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x7531;&#x4E2A;&#x4EBA;&#x6216;&#x8005;&#x7EC4;&#x7EC7;&#x5728;&#x90E8;&#x7F72;&#x65F6;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5728;Apple&#x4E0A;&#x6CE8;&#x518C;&#x3002;</p>
<p>iBeacon&#x4F9D;&#x8D56;&#x4E8E;BLE&#xFF08;&#x4F4E;&#x529F;&#x8017;&#x84DD;&#x7259;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;iPhone4s&#x4EE5;&#x4E0A;&#xFF0C;iPod touch5&#x4EE3;&#x4EE5;&#x4E0A;&#xFF0C;iPad 3&#x4EE5;&#x4E0A;&#x6216;&#x8005;iPad mini&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7684;iBeacon&#x8BBE;&#x5907;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7533;&#x8BF7;Apple License&#x3002;&#x8BF7;&#x8BBF;&#x95EE;<br><a href="https://developer.apple.com/ibeacon" target="_blank" rel="external">https://developer.apple.com/ibeacon</a> &#x7533;&#x8BF7;iBeacon license&#x3002;</p>
<h2 id="iBeacon&#x8F6F;&#x4EF6;-&#xFF0D;-Core-Location-APIs"><a href="#iBeacon&#x8F6F;&#x4EF6;-&#xFF0D;-Core-Location-APIs" class="headerlink" title="iBeacon&#x8F6F;&#x4EF6; &#xFF0D; Core Location APIs"></a>iBeacon&#x8F6F;&#x4EF6; &#xFF0D; Core Location APIs</h2><p>iOS7&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;Core Location &#x4F7F;&#x7528;&#x201C;&#x7535;&#x5B50;&#x56F4;&#x680F;&#x201D;&#x6280;&#x672F;&#xFF08;&#x7ECF;&#x7EAC;&#x5EA6;&#x548C;&#x534A;&#x5F84;&#xFF09;&#x5B9A;&#x4E49;&#x76D1;&#x6D4B;&#x533A;&#x57DF;&#x3002;iBeacon &#x5219;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x7684;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x76D1;&#x6D4B;&#x533A;&#x57DF;&#x3002;&#x8FD9;&#x4E2A;&#x5141;&#x8BB8;&#x4FE1;&#x6E90;&#x7ED1;&#x5B9A;&#x5BF9;&#x8C61;&#x4E0D;&#x88AB;&#x56FA;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x4FE1;&#x6807;&#x88C5;&#x7F6E;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x5468;&#x56F4;&#x50CF;&#x98DF;&#x7269;&#x5361;&#x8F66;&#x6216;&#x6E38;&#x8F6E;&#x4E0A;&#x7684;&#x53EF;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x4EE5;&#x7531;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#x3002;&#x8FD9;&#x5C06;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x96F6;&#x552E;&#x8FDE;&#x9501;&#x5E97;&#x5728;&#x6240;&#x6709;&#x5206;&#x5E97;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;iOS&#x8BBE;&#x5907;&#x77E5;&#x9053;&#x5F53;&#x5B83;&#x8FDB;&#x5165;&#x5176;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x3002;</p>
<h3 id="&#x9690;&#x79C1;&#x4E0E;&#x5B9A;&#x4F4D;"><a href="#&#x9690;&#x79C1;&#x4E0E;&#x5B9A;&#x4F4D;" class="headerlink" title="&#x9690;&#x79C1;&#x4E0E;&#x5B9A;&#x4F4D;"></a>&#x9690;&#x79C1;&#x4E0E;&#x5B9A;&#x4F4D;</h3><p>&#x7531;&#x4E8E;iBeacon&#x662F;Core Location&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x505A;&#x76F8;&#x540C;&#x7684;&#x7528;&#x6237;&#x8BB8;&#x53EF;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5982;&#x4E0B;&#x7528;&#x6237;&#x6388;&#x6743;&#x63D0;&#x793A;&#x5F53;App&#x4F7F;&#x7528;iBeacon APIs&#x65F6;&#xFF1A;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x5141;&#x8BB8;.png" alt=""></p>
<p>&#x5E94;&#x7528;&#x4F7F;Core Location&#x7684;API&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x4F1A;&#x51FA;&#x73B0;&#x5728; Privacy &gt; Location Services &#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x6216;&#x8005;&#x62D2;&#x7EDD;&#x5E94;&#x7528;&#x4F7F;&#x7528;iBeacon&#x529F;&#x80FD;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6240;&#x7528;iBeacon&#x76F8;&#x5173;&#x8054;&#x7684;&#x4EFB;&#x4F55;&#x84DD;&#x7259;&#x6570;&#x636E;&#x5305;&#x90FD;&#x88AB;&#x6392;&#x9664;&#x5728;CoreBluetooth&#x7684;API&#x3002;</p>
<h3 id="iBeacon&#x7CBE;&#x5EA6;"><a href="#iBeacon&#x7CBE;&#x5EA6;" class="headerlink" title="iBeacon&#x7CBE;&#x5EA6;"></a>iBeacon&#x7CBE;&#x5EA6;</h3><p>&#x4E3A;&#x4FDD;&#x8BC1;&#x9AD8;&#x6548;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5982;&#x4F55;&#x8003;&#x8651;&#x4FE1;&#x53F7;&#x4ECE;&#x4FE1;&#x6E90;&#x53D1;&#x51FA;&#x540E;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#x548C;&#x786E;&#x5B9A;&#x7CBE;&#x5EA6;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5F53;iOS&#x8BBE;&#x5907;&#x63A5;&#x6536;&#x5230;&#x4FE1;&#x6E90;&#x7684;&#x4FE1;&#x53F7;&#x65F6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#xFF08;RSSI, or Received Signal Strength Indication&#xFF09;&#x6765;&#x786E;&#x5B9A;&#x63A5;&#x8FD1;&#x4FE1;&#x6E90;&#xFF0C;&#x5373;&#x63A5;&#x8FD1;&#x5176;&#x9884;&#x8BA1;&#x7684;&#x7CBE;&#x5EA6;&#x3002;&#x4FE1;&#x53F7;&#x8D8A;&#x5F3A;&#xFF0C;iOS&#x8D8A;&#x63A5;&#x8FD1;&#x4FE1;&#x6E90;&#xFF0C;&#x4FE1;&#x53F7;&#x8D8A;&#x5F31;&#xFF0C;iOS&#x8D8A;&#x8FDC;&#x79BB;&#x4FE1;&#x6E90;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4ECE;&#x73B0;&#x6709;iOS&#x8BBE;&#x5907;&#x7684;GPS&#x7684;&#x5DE5;&#x4F5C;&#x4E0A;&#x7406;&#x89E3;&#x7CBE;&#x5EA6;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5F53;iOS&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x7684;&#x63A5;&#x53D7;&#x5230;GPS&#x4FE1;&#x53F7;&#x65F6;&#xFF08;&#x6BD4;&#x5982;&#x5728;&#x5F00;&#x653E;&#x7684;&#x6237;&#x5916;&#x73AF;&#x5883;&#xFF09;&#xFF0C;&#x4F60;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x80FD;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x88AB;&#x786E;&#x5B9A;&#x3002;&#x5728;&#x5730;&#x56FE;&#x5E94;&#x7528;&#x4E2D;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x770B;&#x51FA;&#x5B9A;&#x4F4D;&#x7CBE;&#x5EA6;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x84DD;&#x8272;&#x7684;&#x5706;&#x5708;&#x8868;&#x793A;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x5907;&#x5728;&#x5BA4;&#x5185;&#x6216;&#x8005;GPS&#x4FE1;&#x53F7;&#x88AB;&#x963B;&#x6321;&#xFF0C;&#x90A3;&#x4E48;&#x84DD;&#x8272;&#x5706;&#x5708;&#x653E;&#x5927;&#x8868;&#x793A;&#x7CBE;&#x5EA6;&#x964D;&#x4F4E;&#x3002;&#x5982;&#x679C;&#x4FE1;&#x53F7;&#x5230;&#x536B;&#x661F;&#x7684;&#x963B;&#x6321;&#x51CF;&#x5C11;&#xFF08;&#x8BBE;&#x5907;&#x79FB;&#x52A8;&#x5230;&#x6237;&#x5916;&#x6216;&#x4ECE;&#x80CC;&#x5305;&#x62FF;&#x51FA;&#xFF09;&#x84DD;&#x8272;&#x5708;&#x5219;&#x4F1A;&#x53D8;&#x5C0F;&#x3002;&#x66F4;&#x597D;&#x7684;&#x4FE1;&#x53F7;&#x63A5;&#x6536;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x7F29;&#x5C0F;&#x8BEF;&#x5DEE;&#x7684;&#x5E45;&#x5EA6;&#xFF0C;&#x66F4;&#x51C6;&#x786E;&#x5B9A;&#x4F4D;&#x3002;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x4FE1;&#x53F7;.png" alt=""></p>
<p>iBeacon&#x7684;&#x4FE1;&#x53F7;&#x88AB;&#x8BBE;&#x5907;&#x63A5;&#x6536;&#xFF0C;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x901A;&#x5E38;&#x4E0E;&#x8BBE;&#x5907;&#x5230;&#x4FE1;&#x53F7;&#x6E90;&#x7684;&#x8DDD;&#x79BB;&#x76F8;&#x5173;&#x3002;&#x5728;&#x7406;&#x60F3;&#x6761;&#x4EF6;&#x4E0B;&#xFF08;&#x8BBE;&#x5907;&#x548C;&#x4FE1;&#x53F7;&#x6E90;&#x4E4B;&#x95F4;&#x7EBF;&#x8DEF;&#x7545;&#x901A;&#xFF09;&#xFF0C;&#x8D8A;&#x9760;&#x8FD1;&#x7ED3;&#x679C;&#x8D8A;&#x7CBE;&#x786E;&#x3002;<br>&#x5982;Figure 1&#x663E;&#x793A;&#xFF0C;&#x8BBE;&#x5907;&#x539F;&#x7406;&#x4FE1;&#x53F7;&#x6E90;&#x65F6;&#xFF0C;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x8D8A;&#x5F31;&#x3002;&#x7531;&#x4E8E;&#x4FE1;&#x53F7;&#x51CF;&#x5F31;&#xFF0C;iOS&#x8BBE;&#x5907;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x9AD8;&#x53EF;&#x4FE1;&#x5EA6;&#x7684;&#x7CBE;&#x5EA6;&#x8868;&#x793A;&#x5230;&#x4FE1;&#x53F7;&#x6E90;&#x7684;&#x63A5;&#x8FD1;&#x8DDD;&#x79BB;&#x3002;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E0A;&#x9762;GPS&#x4E2D;&#x8F83;&#x5927;&#x7684;&#x84DD;&#x8272;&#x5706;&#x5708;&#x3002;</p>
<p>&#x5F53;&#x8BBE;&#x5907;&#x8D8A;&#x9760;&#x8FD1;&#x4FE1;&#x53F7;&#x6E90;&#xFF0C;&#x63A5;&#x6536;&#x5230;&#x7684;&#x4FE1;&#x53F7;&#x5C31;&#x589E;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x7CBE;&#x5EA6;&#x4E5F;&#x63D0;&#x9AD8;&#x3002;&#x8FD9;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;GPS&#x7684;&#x84DD;&#x8272;&#x5706;&#x5708;&#x53D8;&#x5C0F;&#x3002;&#x5982;Figure 2 &#x6240;&#x793A;&#xFF0C;&#x5F53;&#x8BBE;&#x5907;&#x8D8A;&#x9760;&#x8FD1;&#x4FE1;&#x53F7;&#x6E90;&#x65F6;&#x7CBE;&#x5EA6;&#x7684;&#x53EF;&#x4FE1;&#x5EA6;&#x5C31;&#x8D8A;&#x9AD8;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x548C;GPS&#x7C7B;&#x4F3C;&#xFF0C;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x4F1A;&#x88AB;&#x7269;&#x4F53;&#x963B;&#x6321;&#x51CF;&#x5C11;&#xFF0C;&#x5982;&#x5EFA;&#x7B51;&#x7269;&#xFF0C;&#x6216;&#x653E;&#x7F6E;&#x5728;&#x80CC;&#x5305;&#xFF0C;&#x94B1;&#x5305;&#xFF0C;&#x53E3;&#x888B;&#x91CC;&#x3002;&#x4FE1;&#x53F7;&#x8870;&#x51CF;&#xFF0C;&#x6216;&#x4FE1;&#x53F7;&#x7684;&#x5F3A;&#x5EA6;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x53EF;&#x4EE5;&#x7531;&#x8BB8;&#x591A;&#x56E0;&#x7D20;&#x5F15;&#x8D77;&#x3002;&#x4FE1;&#x53F7;&#x6E90;&#x5468;&#x8FB9;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x5982;Figure 3 &#x663E;&#x793A;&#x6709;&#x5899;&#x58C1;&#x5728;&#x4FE1;&#x53F7;&#x6E90;&#x548C;&#x8BBE;&#x5907;&#x4E4B;&#x95F4;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x63A5;&#x6536;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#xFF0C;&#x8FD9;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8BBE;&#x5907;&#x8BA4;&#x4E3A;&#x4FE1;&#x53F7;&#x6E90;&#x8FD8;&#x5728;&#x6BD4;&#x5B83;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#x66F4;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4EBA;&#x4F53;&#x672C;&#x8EAB;&#x4E5F;&#x4F1A;&#x4F7F;&#x84DD;&#x7259;&#x4FE1;&#x53F7;&#x8870;&#x51CF;&#x3002;&#x5F53;&#x4F60;&#x80CC;&#x5BF9;&#x4FE1;&#x53F7;&#x6E90;&#x65F6;&#xFF08;&#x8EAB;&#x4F53;&#x5904;&#x4E8E;&#x8BBE;&#x5907;&#x548C;&#x4FE1;&#x53F7;&#x6E90;&#x4E4B;&#x95F4;&#xFF09;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#xFF0C;&#x51CF;&#x5C11;&#x7CBE;&#x5EA6;&#x3002;Figure 4&#x663E;&#x793A;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x88AB;&#x51CF;&#x5F31;&#x5F53;&#x4EBA;&#x5904;&#x4E8E;&#x4FE1;&#x53F7;&#x6E90;&#x548C;&#x8BBE;&#x5907;&#x4E4B;&#x95F4;&#x65F6;&#x3002;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x8870;&#x51CF;.png" alt=""></p>
<p>&#x5F53;&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x4F7F;&#x7528;GPS&#x6216;&#x8005;iBeancon&#x65F6;&#xFF0C;&#x8003;&#x8651;&#x7CBE;&#x5EA6;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4ECE;Core Location&#x5BF9;&#x8C61;&#x83B7;&#x53D6;&#x7684;&#x503C;(CLLocation&#x7C7B;horizontalAccuracy&#x5C5E;&#x6027;&#xFF0C;&#x6216;&#x8005;CLBeacon&#x7C7B;&#x7684;accuracy &#x5C5E;&#x6027;)&#x8868;&#x660E;&#x5176;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x6216;&#x8BEF;&#x5DEE;&#x3002;&#x4E24;&#x8005;&#x7684;&#x5355;&#x4F4D;&#x90FD;&#x662F;&#x7C73;&#x3002;&#x8BE5;&#x503C;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F4D;&#x7F6E;&#x7684;&#x51C6;&#x786E;&#x6027;&#x8D8A;&#x4F4E;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#x53D6;&#x51B3;&#x4E8E;&#x7269;&#x7406;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4F4E;&#x51C6;&#x786E;&#x5EA6;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<h3 id="&#x533A;&#x57DF;&#x76D1;&#x63A7;"><a href="#&#x533A;&#x57DF;&#x76D1;&#x63A7;" class="headerlink" title="&#x533A;&#x57DF;&#x76D1;&#x63A7;"></a>&#x533A;&#x57DF;&#x76D1;&#x63A7;</h3><p>&#x7C7B;&#x4F3C;&#x4E8E;&#x73B0;&#x6709;&#x7684;&#x201C;&#x7535;&#x5B50;&#x6805;&#x680F;&#x201D;&#x7684;&#x533A;&#x57DF;&#x76D1;&#x63A7;&#xFF0C;&#x5F53;&#x8BBE;&#x5907;&#x8FDB;&#x5165;&#x6216;&#x8005;&#x79BB;&#x5F00;&#x4E00;&#x4E2A;iBeacon&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x80FD;&#x591F;&#x63A5;&#x6536;&#x5230;&#x901A;&#x77E5;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x5F00;&#x59CB;&#x76D1;&#x63A7;&#x4E00;&#x4E2A;Beacon&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x6307;&#x5B9A;iBeacon&#x5E7F;&#x544A;&#x7684;UUID&#x3002; &#x5F53;&#x4E00;&#x4E2A;app&#x88AB;&#x9650;&#x5236;&#x5728;20&#x4E2A;&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7684;UUID&#x5728;&#x591A;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x5BB9;&#x6613;&#x7684;&#x540C;&#x65F6;&#x76D1;&#x63A7;&#x591A;&#x4E2A;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x5982;&#x4E0A;&#x8FDE;&#x9501;&#x96F6;&#x552E;&#x5E97;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x80FD;&#x591F;&#x76D1;&#x63A7;3&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E97;&#x800C;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;UUID&#x3002;&#x8FD9;&#x4E2A;UUID&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x201C;&#x7535;&#x5B50;&#x6805;&#x680F;&#x201D;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x53EF;&#x4F4E;&#x4F30;&#xFF1A;&#x7528;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x5468;&#x56F4;&#x7684;&#x7269;&#x4F53;&#x6216;&#x5730;&#x70B9;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x76D1;&#x89C6;&#x533A;&#x3002;</p>
<p>&#x9664;&#x4E86;UUID&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;Major&#x548C;Minor&#x5B57;&#x6BB5;&#x8FDB;&#x4E00;&#x6B65;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;Beacon&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x3002;&#x540C;&#x6837;&#x662F;&#x8FDE;&#x9501;&#x96F6;&#x552E;&#x5E97;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;app&#x53EA;&#x6307;&#x5B9A;UUID&#xFF0C;&#x5728;&#x8FDB;&#x5165;&#x6216;&#x79BB;&#x5F00;&#x4EFB;&#x4F55;&#x4E00;&#x5BB6;&#x76D1;&#x63A7;&#x7684;&#x5206;&#x5E97;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x901A;&#x77E5;&#x3002;&#x7531;&#x4E8E;Major&#x5B57;&#x6BB5;&#x88AB;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x7279;&#x5B9A;&#x5206;&#x5E97;&#xFF0C;app&#x4F1A;&#x4F7F;&#x7528;UUID&#xFF0B;Major&#x914D;&#x7F6E;Beacon&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x3002;&#x6216;&#x8005;&#x7528;&#x6237;&#x53EA;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x90E8;&#x95E8;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5219;app&#x4F7F;&#x7528;UUID+Major+Minor&#x7684;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x9897;&#x7C92;&#x7EA7;&#x522B;&#x7531;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x8005;&#x8BBE;&#x5B9A;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x52A8;&#x6001;&#x7684;&#x6307;&#x5B9A;&#x3002;</p>
<p>&#x73B0;&#x6709;&#x7684;&#x533A;&#x57DF;&#x68C0;&#x6D4B;&#xFF0C;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x6216;&#x8005;&#x63A8;&#x51FA;&#x65F6;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x901A;&#x77E5;&#x3002;&#x5982;&#x679C;app&#x6CA1;&#x6709;&#x5B9E;&#x65F6;&#x8FD0;&#x884C;&#xFF08;&#x6BD4;&#x5982;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x5173;&#x7CFB;&#x88AB;&#x5173;&#x95ED;&#xFF09;&#xFF0C;&#x7136;&#x540E;app&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x5E76;&#x53D1;&#x751F;&#x901A;&#x77E5;&#x3002;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8003;&#x8651;&#x662F;&#x5728;iOS7&#x8BBE;&#x5907;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x660E;&#x786E;&#x540E;&#x53F0;&#x7A0B;&#x5E8F;&#x4E0D;&#x5237;&#x65B0;&#xFF08;&#x4E0D;&#x8BBA;&#x662F;&#x5168;&#x5C40;&#x6216;&#x8005;&#x6307;&#x5B9A;&#x4F60;&#x7684;app&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7684;app&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x6536;&#x5230;&#x533A;&#x57DF;&#x76D1;&#x63A7;&#x7684;&#x901A;&#x77E5;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x8FD8;&#x80FD;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x6D4B;&#x8DDD;&#x7684;API&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x57FA;&#x4E8E;&#x4F4E;&#x529F;&#x8017;&#x84DD;&#x7259;&#x6280;&#x672F;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x8303;&#x56F4;&#x5728;&#x51E0;&#x5341;&#x7C73;&#xFF0C;&#x6BD4;&#x201C;&#x7535;&#x5B50;&#x6805;&#x680F;&#x201D;&#xFF08;&#x767E;&#x7C73;&#x81F3;&#x5C11;&#xFF09;&#x66F4;&#x52A0;&#x7CBE;&#x786E;&#x3002;&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x8BBA;&#x8FF0;&#xFF0C;&#x201C;&#x7535;&#x5B50;&#x6805;&#x680F;&#x201D;&#x5728;&#x5BA4;&#x5185;&#x7CBE;&#x5EA6;&#x8F83;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;iBeacon&#x6280;&#x672F;&#x80FD;&#x6781;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x5BA4;&#x5185;&#x7684;&#x533A;&#x57DF;&#x76D1;&#x63A7;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7CBE;&#x786E;&#x5EA6;&#x53C8;&#x4F1A;&#x88AB;Beacon&#x6253;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x6240;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x8BBA;&#x7528;&#x6237;&#x5C06;&#x8BBE;&#x5907;&#x653E;&#x5728;&#x80CC;&#x5305;&#x91CC;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x7684;&#x5904;&#x4E8E;&#x8BBE;&#x5907;&#x548C;beacon&#x4E4B;&#x95F4;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x7684;&#x8FDB;&#x5165;&#x548C;&#x9000;&#x51FA;&#x68C0;&#x6D4B;&#x3002;</p>
<h3 id="&#x6D4B;&#x8DDD;"><a href="#&#x6D4B;&#x8DDD;" class="headerlink" title="&#x6D4B;&#x8DDD;"></a>&#x6D4B;&#x8DDD;</h3><p>iOS7 &#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;APIs &#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5230;&#x4FE1;&#x53F7;&#x6E90;&#x7684;&#x5927;&#x81F4;&#x8DDD;&#x79BB;&#xFF0C;&#x4F7F;&#x7528;iBeacon&#x6280;&#x672F;&#x3002;&#x57FA;&#x4E8E;&#x5E38;&#x89C1;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;iOS&#x5E94;&#x7528;&#x8FC7;&#x6EE4;&#x5668;&#x9884;&#x4F30;&#x5230;Beacon&#x7684;&#x63A5;&#x8FD1;&#x7CBE;&#x786E;&#x5EA6;&#x3002;&#x8FD9;&#x4F30;&#x8BA1;&#x662F;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x63A5;&#x8FD1;&#x72B6;&#x6001;&#x4E4B;&#x4E00;&#x8868;&#x793A;&#xFF1A;</p>
<p><img src="/2016/04/01/iBeacon/iBeacon&#x6D4B;&#x8DDD;.png" alt=""></p>
<h2 id="iBeacon&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8003;&#x8651;"><a href="#iBeacon&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8003;&#x8651;" class="headerlink" title="iBeacon&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8003;&#x8651;"></a>iBeacon&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8003;&#x8651;</h2><p>&#x867D;&#x7136;&#x6709;&#x63A5;&#x8FD1;&#x72B6;&#x6001;&#x548C;&#x51C6;&#x786E;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;1:1&#x3002;&#x8003;&#x8651;&#x8FDE;&#x9501;&#x96F6;&#x552E;&#x5E97;&#x5B89;&#x88C5;&#x904D;&#x5E03;&#x5168;&#x56FD;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x533A;&#x57DF;&#x7684;&#x76D1;&#x6D4B;&#xFF0C;&#x68C0;&#x6D4B;&#x8FDB;&#x5165;&#x5230;&#x5E97;&#x91CC;&#x6765;&#x89E6;&#x53D1;&#x672C;&#x5730;&#x901A;&#x77E5;&#xFF0C;&#x6B22;&#x8FCE;&#x7528;&#x6237;&#x5230;&#x5E97;&#xFF0C;&#x5E76;&#x9080;&#x8BF7;&#x4ED6;&#x4EEC;&#x6765;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x672A;&#x907F;&#x514D;&#x9A9A;&#x6270;&#x5230;&#x7528;&#x6237;&#xFF0C;app&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E3A;&#x53EA;&#x6709;&#x7528;&#x6237;&#x7B2C;&#x4E00;&#x6B21;&#x8FDB;&#x5165;&#x5546;&#x5E97;&#x65F6;&#xFF0C;&#x53D1;&#x9001;&#x901A;&#x77E5;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5185;&#x5D4C;&#x8BE5;&#x5E94;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x5E97;&#x5185;&#x5B9A;&#x5236;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x3002;&#x5982;&#x679C;iBeacon&#x7684;&#x5E7F;&#x544A;Major&#x5B57;&#x6BB5;&#x5305;&#x542B;&#x7279;&#x6B8A;&#x5206;&#x5E97;&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x4E48;app&#x5C31;&#x80FD;&#x7ACB;&#x9A6C;&#x77E5;&#x9053;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x54EA;&#x4E2A;&#x5546;&#x5E97;&#x3002;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x6D4B;&#x8DDD;&#x60C5;&#x51B5;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5728;&#x6700;&#x524D;&#x7AEF;&#xFF0C;&#x8BBE;&#x5907;&#x62FF;&#x5728;&#x7528;&#x6237;&#x624B;&#x4E0A;&#xFF0C;&#x5C4F;&#x5E55;&#x70B9;&#x4EAE;&#x3002;&#x5927;&#x578B;&#x5BB6;&#x88C5;&#x5356;&#x573A;&#x5F80;&#x5F80;&#x6709;&#x8BB8;&#x591A;&#x8D70;&#x9053;&#x548C;&#x90E8;&#x95E8;&#x3002;&#x5C06;Beacon&#x8BBE;&#x5907;&#x5B89;&#x88C5;&#x5728;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x7AEF;&#x90E8;&#x548C;&#x5404;&#x90E8;&#x95E8;&#x5185;&#xFF0C;app&#x5C31;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x548C;Beacon&#x7684;&#x63A5;&#x8FD1;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5730;&#x56FE;&#x5E94;&#x7528;&#x4E2D;&#x663E;&#x793A;&#x7528;&#x6237;&#x7684;&#x5927;&#x81F4;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;Near&#x6216;Immediate&#xFF08;&#x5982;&#x679C;&#x7528;&#x6237;&#x624B;&#x6301;iphone&#x5230;&#x7279;&#x5B9A;&#x7684;Beacon&#x70B9;&#x65F6;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x7269;&#x7406;&#x5BF9;&#x8C61;&#xFF08;&#x901A;&#x5E38;&#x4E3A;&#x91D1;&#x5C5E;&#x67B6;&#xFF0C;&#x5927;&#x578B;&#x7B28;&#x91CD;&#x663E;&#x793A;&#x9879;&#x76EE;&#x7B49;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5BA2;&#x6237;&#x5374;&#x770B;&#x5230;&#x51FA;&#x73B0;proximities&#x6216;&#x8005;Far&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;app&#x53EF;&#x80FD;&#x4F1A;&#x663E;&#x793A;&#x9644;&#x8FD1;&#x7684;&#x5176;&#x4ED6;Beacon&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x9501;&#x5B9A;&#x5230;&#x7528;&#x6237;&#x9644;&#x8FD1;&#x7684;&#x4FE1;&#x53F7;&#x6E90;&#x3002;&#x76F8;&#x53CD;&#xFF0C;app&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x624B;&#x52A8;&#x6307;&#x5B9A;&#x8BE5;&#x6700;&#x6709;&#x5173;&#x8054;&#x7684;&#x5E97;&#xFF08;&#x4E0D;&#x8BBA;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x5174;&#x8DA3;&#x6216;&#x8005;&#x4ED6;&#x4EEC;&#x5B9E;&#x9645;&#x6700;&#x8FD1;&#x7684;Beacon&#x4F4D;&#x7F6E;&#xFF09;&#x3002;</p>
<h3 id="&#x4F18;&#x60E0;&#x5238;"><a href="#&#x4F18;&#x60E0;&#x5238;" class="headerlink" title="&#x4F18;&#x60E0;&#x5238;"></a>&#x4F18;&#x60E0;&#x5238;</h3><p>&#x4F18;&#x60E0;&#x5238;&#x4E5F;&#x80FD;&#x591F;&#x901A;&#x8FC7;iBeacon&#x6280;&#x672F;&#x7684;&#x8BBE;&#x5907;&#x4F20;&#x9012;&#x51FA;&#x53BB;&#x3002;&#x901A;&#x8FC7;&#x5305;&#x542B;&#x4FE1;&#x53F7;&#x7684;UUID&#xFF0C;&#x4F18;&#x60E0;&#x5238;&#x4FE1;&#x606F;&#x80FD;&#x591F;&#x53D1;&#x9001;&#x5F53;&#x8FDB;&#x5165;beacon&#x76D1;&#x63A7;&#x533A;&#x57DF;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x4E0E;&#xFF08;&#x201C;&#x7535;&#x5B50;&#x6805;&#x680F;&#x201D;&#xFF09;&#x6307;&#x5B9A;latitude &#x548C;longitude&#x7684;&#x5728;&#x4F4D;&#x7F6E;&#x4F60;&#x7ECF;&#x8FC7;&#x7684;&#x65B9;&#x5F0F;&#x76F8;&#x540C;&#x3002;&#x4F60;&#x80FD;&#x591F;&#x6307;&#x5B9A;UUID&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x9009;&#x7684;Major&#xFF0C;Minor&#x5B57;&#x6BB5;&#x503C;&#x7EC4;&#x6210;&#x7684;&#x7EC4;&#x5408;&#x5728;Beacon&#x533A;&#x57DF;&#x5185;&#xFF0C;&#x80FD;&#x591F;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x90E8;&#x7F72;iBeacon"><a href="#&#x90E8;&#x7F72;iBeacon" class="headerlink" title="&#x90E8;&#x7F72;iBeacon"></a>&#x90E8;&#x7F72;iBeacon</h2><p>&#x5F53;&#x4F60;&#x51C6;&#x5907;&#x90E8;&#x7F72;&#x57FA;&#x4E8E;iBeacon&#x6280;&#x672F;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x8BC4;&#x4F30;&#x4F60;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h3 id="&#x7269;&#x7406;&#x9650;&#x5236;"><a href="#&#x7269;&#x7406;&#x9650;&#x5236;" class="headerlink" title="&#x7269;&#x7406;&#x9650;&#x5236;"></a>&#x7269;&#x7406;&#x9650;&#x5236;</h3><p>iBeacon &#x8BBE;&#x5907;&#x4F7F;&#x7528;&#x4F4E;&#x529F;&#x8017;&#x84DD;&#x7259;&#x4F20;&#x8F93;&#x5E7F;&#x64AD;&#x4FE1;&#x53F7;&#x3002;BLE&#x57FA;&#x4E8E;2.4G&#x9891;&#x7387;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7A7F;&#x8FC7;&#x5404;&#x79CD;&#x7269;&#x4F53;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#x5899;&#xFF0C;&#x95E8;&#x6216;&#x5176;&#x4ED6;&#x7269;&#x4F53;&#x7ED3;&#x6784;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x8870;&#x51CF;&#x3002;2.4G&#x9891;&#x7387;&#x4FE1;&#x53F7;&#x540C;&#x6837;&#x4F1A;&#x88AB;&#x6C34;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x4EBA;&#x4F53;&#x4E5F;&#x4F1A;&#x51CF;&#x5C11;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x3002;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#xFF0C;iOS&#x8BBE;&#x5907;&#x63A5;&#x6536;&#x5230;&#x7684;&#x4FE1;&#x53F7;&#x4F1A;&#x88AB;&#x8870;&#x51CF;&#xFF0C;&#x88AB;&#x51CF;&#x5F31;&#x3002;&#x7EFC;&#x4E0A;&#x6240;&#x5982;&#xFF0C;&#x5F53;&#x63A5;&#x53D7;&#x5230;&#x7684;&#x4FE1;&#x53F7;&#x51CF;&#x5F31;&#x540E;&#xFF0C;iOS&#x8BBE;&#x5907;&#x9884;&#x4F30;&#x5230;iBeacon&#x7684;&#x63A5;&#x8FD1;&#x7A0B;&#x5EA6;&#x7684;&#x80FD;&#x529B;&#x4E5F;&#x4F1A;&#x964D;&#x4F4E;&#x3002;</p>
<h3 id="&#x6821;&#x51C6;iBeacon"><a href="#&#x6821;&#x51C6;iBeacon" class="headerlink" title="&#x6821;&#x51C6;iBeacon"></a>&#x6821;&#x51C6;iBeacon</h3><p>&#x4E3A;&#x63D0;&#x4F9B;&#x6700;&#x4F73;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5728;&#x90E8;&#x7F72;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x6821;&#x51C6;&#x662F;&#x5173;&#x952E;&#x7684;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;Beacon&#x7684;&#x5B89;&#x88C5;&#xFF0C;&#x60A8;&#x90FD;&#x9700;&#x8981;&#x6267;&#x884C;&#x6821;&#x51C6;&#x3002;Core Location&#x4F7F;&#x7528;1&#x7C73;&#x8DDD;&#x79BB;&#x6821;&#x51C6;&#x4F30;&#x7B97;&#x6A21;&#x578B;&#x3002;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x6821;&#x51C6;&#x4F60;&#x9700;&#x8981;&#xFF1A;</p>
<pre><code>1.    &#x5B89;&#x88C5;Beacon&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;
2.    &#x4F7F;&#x7528;iOS7&#x4EE5;&#x4E0A;iPhone&#x6216;ipod touch&#xFF0C;&#x5E76;&#x5F00;&#x542F;&#x84DD;&#x7259;&#xFF0C;&#x53CD;&#x590D;&#x5728;1&#x7C73;&#x4F4D;&#x7F6E;&#x4E0A;&#x91C7;&#x6837;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x81F3;&#x5C11;10s&#x4EE5;&#x4E0A;&#x3002;&#x5F53;&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x8BFB;&#x6570;&#x65F6;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x624B;&#x6301;&#x8BBE;&#x5907;&#x5782;&#x76F4;&#x4E8E;&#x8BBE;&#x5907;&#x4E0A;&#x534A;&#x90E8;&#x5206;&#x3002;
3.    &#x7F13;&#x6162;&#x7684;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x5728;30cm&#x7EBF;&#xFF0C;&#x4FDD;&#x6301;&#x65B9;&#x5411;&#xFF0C;&#x5E76;&#x4E14;&#x7B49;&#x8DDD;&#x7684;&#x6D4B;&#x91CF;&#x8BBE;&#x5907;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;
4.    &#x5728;&#x6821;&#x51C6;&#x7684;&#x671F;&#x95F4;&#xFF0C;&#x6536;&#x96C6;CLBeacon&#x7684;rssi&#x5C5E;&#x6027;&#x7684;&#x503C;
5.    &#x5E73;&#x5747;&#x6536;&#x96C6;&#x7684;RSSI&#x503C;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x6D4B;&#x5F97;&#x7684;&#x503C;&#x3002;
6.    &#x5E94;&#x7528;&#x8FD9;&#x4E2A;&#x6D4B;&#x91CF;&#x503C;&#xFF0C;&#x53C2;&#x8003;&#x4F7F;&#x7528;&#x7684;Becean&#x7684;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x4E0D;&#x540C;&#x5382;&#x5546;&#x4E4B;&#x95F4;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x76F8;&#x540C;
</code></pre><p><img src="/2016/04/01/iBeacon/iBeacon&#x6821;&#x51C6;.png" alt=""></p>
<p>&#x5982;&#x4E0A;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x7269;&#x7406;&#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x5F71;&#x54CD;&#x4FE1;&#x53F7;&#x5F3A;&#x5EA6;&#x3002;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;Beacon&#x7684;&#x5B89;&#x88C5;&#x73AF;&#x5883;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x91CD;&#x590D;&#x4EE5;&#x4E0A;&#x6B65;&#x9AA4;&#x5B89;&#x88C5;Beacon&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<h3 id="&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"><a href="#&#x6700;&#x4F73;&#x5B9E;&#x8DF5;" class="headerlink" title="&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"></a>&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h3><p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x548C;&#x6210;&#x529F;&#x90E8;&#x7F72;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x6700;&#x4F73;&#x505A;&#x6CD5;&#xFF1A;</p>
<pre><code>1.    &#x6D4B;&#x8DDD;&#x7684;API&#x4E0D;&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x4F7F;&#x7528;&#x3002;&#x4E3A;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7ED3;&#x679C;&#xFF0C;&#x6D4B;&#x8DDD;&#x65F6;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x7684;App&#x5728;&#x6700;&#x524D;&#x7AEF;&#xFF0C;&#x7528;&#x6237;&#x4E0E;&#x60A8;&#x7684;app&#x8FDB;&#x884C;&#x4EA4;&#x4E92;
2.    &#x5F53;&#x4F7F;&#x7528;&#x6D4B;&#x8DDD;API&#x65F6;&#xFF0C;&#x591A;&#x4E2A;iBeacon&#x8BBE;&#x5907;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#xFF0C;Core Location&#x4F1A;&#x4E0A;&#x62A5;&#x8FD9;&#x4E9B;Beacons&#x987A;&#x5E8F;&#xFF0C;&#x662F;&#x79BB;&#x5176;&#x6700;&#x8FD1;&#x7684;&#x6700;&#x4F73;&#x7684;&#x9884;&#x4F30;&#x3002;&#x7531;&#x4E8E;&#x4E0A;&#x9762;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x4FE1;&#x53F7;&#x8870;&#x51CF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x987A;&#x5E8F;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4FE1;&#x6807;&#x88AB;&#x9644;&#x52A0;&#x5230;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;iOS&#x8BBE;&#x5907;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x662F;&#x6BD4;&#x53E6;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5F3A;&#xFF0C;&#x4F46;&#x5728;&#x7269;&#x7406;&#x4E0A;&#x662F;&#x8FDC;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8FDC;&#x79BB;beacon&#x88AB;&#x9996;&#x6B21;&#x62A5;&#x9053;&#x3002;App&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x68C0;&#x6D4B;Beacon&#x4E0A;&#x62A5;&#x7684;Proximity&#x533A;&#x57DF;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x4E0A;&#x62A5;&#x7684;&#x90FD;&#x5904;&#x4E8E;Far&#x533A;&#x57DF;&#xFF0C;&#x518D;&#x8003;&#x8651;&#x4E0A;&#x62A5;&#x7684;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x5728;&#x9644;&#x8FD1;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7528;&#x6237;&#x9009;&#x62E9;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5BF9;&#x8C61;&#x3002;
3.     &#x5229;&#x7528;&#x4F4D;&#x7F6E;&#x6388;&#x6743;&#x63D0;&#x793A;&#x6846;&#x53EF;&#x9009;&#x7684;&#x6587;&#x5B57;&#x6765;&#x89E3;&#x91CA;App&#x8981;&#x6C42;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x4F4D;&#x7F6E;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;app&#x51FA;&#x73B0;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#xFF0C;&#x89E3;&#x91CA;&#x4E3A;&#x4F55;&#x7528;&#x6237;&#x540C;&#x610F;&#x4F7F;&#x7528;&#x8BE5;App&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x4F4D;&#x7F6E;&#x7684;&#x597D;&#x5904;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53EF;&#x9009;&#x7684;&#x6587;&#x5B57;&#x4F7F;&#x7528;NSLocationUsageDescription &#x5728;&#x4F60;&#x7684;app&#x7684;.plist&#x6587;&#x4EF6;&#x4E2D;&#x3002;
4.    &#x5982;&#x679C;&#x4F60;&#x662F;&#x8D2D;&#x4E70;iBeacon&#x6280;&#x672F;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x8BBE;&#x5907;&#xFF0C;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#x548C;&#x8C01;&#x53BB;&#x505A;&#x597D;&#x5B89;&#x88C5;&#xFF0C;&#x7EF4;&#x62A4;&#x4FDD;&#x517B;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;
5.    &#x5F53;&#x90E8;&#x7F72;beacon&#x8BBE;&#x5907;&#x5728;&#x573A;&#x6240;&#x5185;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x786E;&#x4FDD;&#x8BAD;&#x7EC3;&#x9700;&#x8981;&#x4E0E;&#x5B83;&#x4EEC;&#x4EA4;&#x4E92;&#x7684;&#x5458;&#x5DE5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x90E8;&#x7F72;&#x96F6;&#x552E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x786E;&#x4FDD;&#x60A8;&#x7684;&#x96F6;&#x552E;&#x9500;&#x552E;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x57F9;&#x8BAD;&#xFF0C;&#x5BF9;iOS&#x5E94;&#x7528;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x7ED9;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#xFF0C;&#x652F;&#x6301;iOS&#x8BBE;&#x5907;&#x578B;&#x53F7;&#xFF0C;&#x6545;&#x969C;&#x6392;&#x9664;&#x5EFA;&#x8BAE;&#xFF0C;&#x7B49;&#x7B49;&#x3002;
6.     &#x5982;&#x679C;&#x60A8;&#x8BA1;&#x5212;&#x5728;&#x6307;&#x793A;&#x724C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x662F;&#x9F13;&#x52B1;&#x4F60;&#x6709;iBeacon&#x5546;&#x6807;&#x548C;&#x6807;&#x8BC6;&#x8BB8;&#x53EF;&#x3002;&#x8BF7;&#x8BBF;&#x95EE;&lt;https://developer.apple.com/ibeacon&gt; &#x7533;&#x8BF7;iBeacon License&#x3002;
</code></pre>
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/04/01/iBeacon/" data-id="cimhh0si70000gaxlx2h88fba" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/iOS/">iOS</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
  
    <a href="/2016/03/22/iOS9-WiFi-Hotspot/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">iOS9_WiFi_Hotspot</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/iOS/">iOS</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/iOS/" style="font-size: 10px;">iOS</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/04/">April 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/03/">March 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/04/01/iBeacon/">Getting Started with iBeacon</a>
          </li>
        
          <li>
            <a href="/2016/03/22/iOS9-WiFi-Hotspot/">iOS9_WiFi_Hotspot</a>
          </li>
        
          <li>
            <a href="/2016/03/22/新的开始/">新的开始</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Muzizhu<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>